app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def index
    @user = User.find_by(id: session[:user_id])