app/controllers/password_resets_controller.rb

  def update
    @user = User.find_signed!(params[:token], purpose: 'password_reset')
    return unless @user.update(password_params)
---
UPDATE "users" SET "password_digest" = '$2a$12$9lE0vn5ZOzx3V6cAaHyOfeofMRKrRY/33MDNRT.6qSlwcoTKc7uoa', "updated_at" = '2025-07-01 18:55:55.468245' WHERE "users"."id" = 9