app/controllers/passwords_controller.rb

  def update
    if Current.user.update(password_params)
---
UPDATE "users" SET "password_digest" = '$2a$12$TVGCQsO0orAhAEU.RCycCO4NlKcChs2x4K.iYAJw/CgrkMdbVzU1e', "updated_at" = '2025-07-01 14:51:51.175722' WHERE "users"."id" = 9